{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-ADDR",
    "2": "B-ORG",
    "3": "B-PER",
    "4": "I-ADDR",
    "5": "I-ORG",
    "6": "I-PER"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-ADDR": 1,
    "B-ORG": 2,
    "B-PER": 3,
    "I-ADDR": 4,
    "I-ORG": 5,
    "I-PER": 6,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.4",
  "vocab_size": 30522
}
